In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import *

In [3]:
# creer une session
spark = SparkSession.builder.appName("LIG3").getOrCreate()

In [4]:
# chargeons le fichier
df = spark.read.format("csv").options(header='True').load("employees.csv")
df.show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
| 10| Clara| 27|   3800|         IT|   2023-02-14|
+---+------+---+-------+-----------+-------------+

In [134]:
df1 = spark.read.format("csv").options(header='True').load("manager.csv")
df.show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
| 10| Clara| 27|   3800|         IT|   2023-02-14|
+---+------+---+-------+-----------+-------------+

In [135]:
# creons une shema
shema = StructType([
    StructField("id", IntegerType(),False),
    StructField("nom", StringType(),False),
     StructField("age", IntegerType(), False),
    StructField("salaire", IntegerType(), False),
    StructField("departement", StringType(),False),
    StructField("date_embauche", DateType(),False),
])

In [136]:
# mettre a jours les types de variable
df = (
    spark.read
    .format("csv")
    .schema(shema)
    .options(header="true")
    .load("employees.csv")
)
df.show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
| 10| Clara| 27|   3800|         IT|   2023-02-14|
+---+------+---+-------+-----------+-------------+

In [137]:
# employe de It
df.filter(df["departement"] == 'IT').show()

+---+-----+---+-------+-----------+-------------+
| id|  nom|age|salaire|departement|date_embauche|
+---+-----+---+-------+-----------+-------------+
|  1|  Ali| 25|   3000|         IT|   2020-06-15|
|  4| Nina| 35|   5500|         IT|   2016-12-05|
|  7|  Tom| 33|   4700|         IT|   2017-03-17|
| 10|Clara| 27|   3800|         IT|   2023-02-14|
+---+-----+---+-------+-----------+-------------+

In [139]:
# creons une vue
df.createOrReplaceTempView("mgg")

In [140]:
# avec sparksql : employer IT
spark.sql("SELECT * FROM mgg WHERE departement == 'IT'").show()

+---+-----+---+-------+-----------+-------------+
| id|  nom|age|salaire|departement|date_embauche|
+---+-----+---+-------+-----------+-------------+
|  1|  Ali| 25|   3000|         IT|   2020-06-15|
|  4| Nina| 35|   5500|         IT|   2016-12-05|
|  7|  Tom| 33|   4700|         IT|   2017-03-17|
| 10|Clara| 27|   3800|         IT|   2023-02-14|
+---+-----+---+-------+-----------+-------------+

In [141]:
# employes dont le salaire > 4000 avec spark
df.filter(df["salaire"] > 4000).show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
+---+------+---+-------+-----------+-------------+

In [142]:
# avec sparksql: salaire > 4000
spark.sql("SELECT * FROM mgg WHERE salaire > 4000").show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
+---+------+---+-------+-----------+-------------+

In [143]:
# moyenne des salaire avec spark
df.agg(mean("salaire").alias("moy_sal")).show()

+-----------------+
|          moy_sal|
+-----------------+
|4466.666666666667|
+-----------------+

In [144]:
# avec spark sql
spark.sql("SELECT AVG(salaire) as moy_sal FROM mgg").show()

+-----------------+
|          moy_sal|
+-----------------+
|4466.666666666667|
+-----------------+

In [145]:
# alculer l'ancienete
df.withColumn("ancienete", 2025- year(df["date_embauche"])).show()

+---+------+---+-------+-----------+-------------+---------+
| id|   nom|age|salaire|departement|date_embauche|ancienete|
+---+------+---+-------+-----------+-------------+---------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|        5|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|        7|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|        6|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|        9|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|       13|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|        4|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|        8|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|        3|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|       10|
| 10| Clara| 27|   3800|         IT|   2023-02-14|        2|
+---+------+---+-------+-----------+-------------+---------+

In [147]:
# trier par age asc
df.orderBy(asc("age")).show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|
| 10| Clara| 27|   3800|         IT|   2023-02-14|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
+---+------+---+-------+-----------+-------------+

In [148]:
# avec sparksql
spark.sql("SELECT * FROM mgg ORDER BY age ASC").show()

+---+------+---+-------+-----------+-------------+
| id|   nom|age|salaire|departement|date_embauche|
+---+------+---+-------+-----------+-------------+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|
| 10| Clara| 27|   3800|         IT|   2023-02-14|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|
+---+------+---+-------+-----------+-------------+

In [149]:
# employer par departement
df.groupby("departement").agg(count("nom").alias("emp_dep")).show()

+-----------+-------+
|departement|emp_dep|
+-----------+-------+
|         RH|      3|
|    Finance|      3|
|         IT|      4|
+-----------+-------+

In [150]:
# sparksql
spark.sql("SELECT COUNT(*) as emp_dep, departement FROM mgg GROUP BY departement").show()

+-------+-----------+
|emp_dep|departement|
+-------+-----------+
|      3|         RH|
|      3|    Finance|
|      4|         IT|
+-------+-----------+

In [151]:
# Calculer le salaire moyen par département 
df.groupby("departement").agg(mean("salaire").alias("sal_moy_dep")).show()

+-----------+-----------------+
|departement|      sal_moy_dep|
+-----------+-----------------+
|         RH|5233.333333333333|
|    Finance|           3750.0|
|         IT|           4250.0|
+-----------+-----------------+

In [153]:
# avec sparksql
spark.sql("SELECT AVG(salaire) as sal_moy_dep, departement FROM mgg GROUP BY departement").show()

+-----------------+-----------+
|      sal_moy_dep|departement|
+-----------------+-----------+
|5233.333333333333|         RH|
|           3750.0|    Finance|
|           4250.0|         IT|
+-----------------+-----------+

In [154]:
# prime 10%
df.withColumn("prime", df["salaire"] * 0.1).show()

+---+------+---+-------+-----------+-------------+-----+
| id|   nom|age|salaire|departement|date_embauche|prime|
+---+------+---+-------+-----------+-------------+-----+
|  1|   Ali| 25|   3000|         IT|   2020-06-15|300.0|
|  2|Sophie| 30|   4500|         RH|   2018-04-10|450.0|
|  3|  Marc| 28|   4000|    Finance|   2019-08-21|400.0|
|  4|  Nina| 35|   5500|         IT|   2016-12-05|550.0|
|  5|  Jean| 40|   6000|         RH|   2012-09-30|600.0|
|  6|  Lisa| 29|   NULL|    Finance|   2021-07-11| NULL|
|  7|   Tom| 33|   4700|         IT|   2017-03-17|470.0|
|  8|  Emma| 26|   3500|    Finance|   2022-01-20|350.0|
|  9|  Paul| 31|   5200|         RH|   2015-05-28|520.0|
| 10| Clara| 27|   3800|         IT|   2023-02-14|380.0|
+---+------+---+-------+-----------+-------------+-----+

In [155]:
df.agg(std("salaire").alias("ecart_t_sal")).show()

+-----------------+
|      ecart_t_sal|
+-----------------+
|984.8857801796105|
+-----------------+

In [157]:
df1.join(df, "departement", "Left").show()

+-----------+----------+-----------+---+------+---+-------+-------------+
|departement|id_manager|nom_manager| id|   nom|age|salaire|date_embauche|
+-----------+----------+-----------+---+------+---+-------+-------------+
|         IT|         1|  M. Dupont| 10| Clara| 27|   3800|   2023-02-14|
|         IT|         1|  M. Dupont|  7|   Tom| 33|   4700|   2017-03-17|
|         IT|         1|  M. Dupont|  4|  Nina| 35|   5500|   2016-12-05|
|         IT|         1|  M. Dupont|  1|   Ali| 25|   3000|   2020-06-15|
|         RH|         2|  Mme Leroy|  9|  Paul| 31|   5200|   2015-05-28|
|         RH|         2|  Mme Leroy|  5|  Jean| 40|   6000|   2012-09-30|
|         RH|         2|  Mme Leroy|  2|Sophie| 30|   4500|   2018-04-10|
|    Finance|         3| M. Garnier|  8|  Emma| 26|   3500|   2022-01-20|
|    Finance|         3| M. Garnier|  6|  Lisa| 29|   NULL|   2021-07-11|
|    Finance|         3| M. Garnier|  3|  Marc| 28|   4000|   2019-08-21|
+-----------+----------+-----------+---+------+---+-------+-------------+

In [159]:
df.filter(df["departement"]=='Finance').show()

+---+----+---+-------+-----------+-------------+
| id| nom|age|salaire|departement|date_embauche|
+---+----+---+-------+-----------+-------------+
|  3|Marc| 28|   4000|    Finance|   2019-08-21|
|  6|Lisa| 29|   NULL|    Finance|   2021-07-11|
|  8|Emma| 26|   3500|    Finance|   2022-01-20|
+---+----+---+-------+-----------+-------------+

In [181]:
df.groupby("departement").agg(mean("age").alias("moy_dep_age")).show()

+-----------+------------------+
|departement|       moy_dep_age|
+-----------+------------------+
|         RH|33.666666666666664|
|    Finance|27.666666666666668|
|         IT|              30.0|
+-----------+------------------+

In [187]:
spark.sql("select avg(age) as age_moy_dep,departement from mgg group by departement").show()

+------------------+-----------+
|       age_moy_dep|departement|
+------------------+-----------+
|33.666666666666664|         RH|
|27.666666666666668|    Finance|
|              30.0|         IT|
+------------------+-----------+

In [189]:
spark.sql("select max(salaire) as sal_max,departement from mgg group by departement").show()

+-------+-----------+
|sal_max|departement|
+-------+-----------+
|   6000|         RH|
|   4000|    Finance|
|   5500|         IT|
+-------+-----------+

In [199]:
spark.sql("select * from mgg where departement like '%e'").show()

+---+----+---+-------+-----------+-------------+
| id| nom|age|salaire|departement|date_embauche|
+---+----+---+-------+-----------+-------------+
|  3|Marc| 28|   4000|    Finance|   2019-08-21|
|  6|Lisa| 29|   NULL|    Finance|   2021-07-11|
|  8|Emma| 26|   3500|    Finance|   2022-01-20|
+---+----+---+-------+-----------+-------------+